vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1042_DFP.pdsc
    <condition id='anyOf.driver.edma.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='edma'/>
    </condition>
    <condition id='component.mcxw_flash_adapter.condition_id'>
      <require condition='allOf.driver.romapi, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.driver.romapi, device=MIMXRT1042.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='romapi'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.mem_manager.condition_id'>
      <require condition='allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager_legacy'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager_light'/>
    </condition>
    <condition id='component.mem_manager_legacy.condition_id'>
      <require condition='allOf.component.mem_manager, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.component.mem_manager, device=MIMXRT1042.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.mem_manager_light.condition_id'>
      <require condition='allOf.component.mem_manager, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.messaging.condition_id'>
      <require condition='allOf.component.lists, component.mem_manager, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.component.lists, component.mem_manager, device=MIMXRT1042.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mem_manager'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.mflash_offchip.condition_id'>
      <require condition='allOf.anyOf=driver.cache_armv7_m7, driver.flexspi, driver.romapi, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.cache_armv7_m7, driver.flexspi, driver.romapi, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.cache_armv7_m7, driver.flexspi, driver.romapi.internal_condition'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.cache_armv7_m7, driver.flexspi, driver.romapi.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='cache_armv7_m7'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='flexspi'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='romapi'/>
    </condition>
    <condition id='component.mflash_onchip.condition_id'>
      <require condition='allOf.anyOf=driver.cache_armv7_m7, driver.romapi, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.cache_armv7_m7, driver.romapi, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.cache_armv7_m7, driver.romapi.internal_condition'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.cache_armv7_m7, driver.romapi.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='cache_armv7_m7'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='romapi'/>
    </condition>
    <condition id='component.mflash_onchip_fmu.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.nvm_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.panic.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.pcm186x_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.pcm512x_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phyaqr113c.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='phy-common'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phyar8031.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phydp8384x.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phygpy215.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phyksz8041.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phyksz8081.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phylan8720a.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phylan8741.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phyrtl8201.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phyrtl8211f.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phytja1100.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.phytja1120.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1042.internal_condition'/>
    </condition>
