vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1042_DFP.pdsc
    <condition id='allOf.CMSIS_Driver_Include.Ethernet, CMSIS_Driver_Include.Ethernet_MAC, CMSIS_Driver_Include.Ethernet_PHY, component.eth_phy_common, device.RTE, driver.enet, device_id=MIMXRT1042xxxxB.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='Ethernet' Capiversion='2.2.0'/>
      <require Cclass='CMSIS Driver' Cgroup='Ethernet MAC' Capiversion='2.2.0'/>
      <require Cclass='CMSIS Driver' Cgroup='Ethernet PHY' Capiversion='2.2.0'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='phy-common'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='enet'/>
      <require condition='device_id.MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_lpi2c.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MIMXRT1042xxxxB, device.RTE, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MIMXRT1042xxxxB, device.RTE, device_id=MIMXRT1042xxxxB.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='I2C' Capiversion='2.4.0'/>
      <require condition='anyOf.allOf=driver.lpi2c, device_id=MIMXRT1042xxxxB.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require condition='device_id.MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=driver.lpi2c, device_id=MIMXRT1042xxxxB.internal_condition'>
      <accept condition='allOf.driver.lpi2c, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpi2c, device_id=MIMXRT1042xxxxB.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device_id.MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_lpspi.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MIMXRT1042xxxxB, device.RTE, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MIMXRT1042xxxxB, device.RTE, device_id=MIMXRT1042xxxxB.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='SPI' Capiversion='2.3.0'/>
      <require condition='anyOf.allOf=driver.lpspi, device_id=MIMXRT1042xxxxB.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require condition='device_id.MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=driver.lpspi, device_id=MIMXRT1042xxxxB.internal_condition'>
      <accept condition='allOf.driver.lpspi, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpspi, device_id=MIMXRT1042xxxxB.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device_id.MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_lpuart.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MIMXRT1042xxxxB, device.RTE, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MIMXRT1042xxxxB, device.RTE, device_id=MIMXRT1042xxxxB.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='USART' Capiversion='2.4.0'/>
      <require condition='anyOf.allOf=driver.lpuart, device_id=MIMXRT1042xxxxB.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require condition='device_id.MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=driver.lpuart, device_id=MIMXRT1042xxxxB.internal_condition'>
      <accept condition='allOf.driver.lpuart, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpuart, device_id=MIMXRT1042xxxxB.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
      <require condition='device_id.MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.codec.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.common.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.cores=cm7f.condition_id'>
      <require condition='cores.cm7f.internal_condition'/>
    </condition>
    <condition id='cores.cm7f.internal_condition'>
      <accept Dcore='Cortex-M7'/>
    </condition>
    <condition id='driver.cs42448.condition_id'>
      <require condition='allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MIMXRT1042.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_adapters'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_i2c'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='cs42448_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.cs42888.condition_id'>
      <require condition='allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.component.codec_adapters, component.codec_i2c, component.cs42888_adapter, driver.codec, device=MIMXRT1042.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_adapters'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_i2c'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='cs42888_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
