vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1042_DFP.pdsc
    <condition id='driver.flexcan.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.flexcan_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.flexcan, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.flexcan, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexcan'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.flexio.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.flexio_i2c_master.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flexio, device_id=MIMXRT1042xxxxB.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio'/>
      <require condition='device_id.MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.flexio_i2s.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.flexio_i2s_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.flexio_i2s, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.flexio_i2s, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_i2s'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.flexio_spi.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.flexio_spi_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.flexio_spi, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.flexio_spi, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.flexio_uart, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.flexio_uart, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.flexram.condition_id'>
      <require condition='allOf.driver.common, driver.flexram_allocate, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.flexram_allocate, device_id=MIMXRT1042xxxxB.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='soc_flexram_allocate'/>
      <require condition='device_id.MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.flexram_allocate.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.flexspi.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.flexspi_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.flexspi, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.flexspi, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexspi'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.ft3267.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.ft5406.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.ft5406_rt.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.ft6x06.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.I2C, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.I2C, device=MIMXRT1042.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='I2C' Capiversion='2.4.0'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.fxas21002cq.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.fxls8974cf.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.fxos8700cq.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.gpc_1.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.gpt.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
