vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1042_DFP.pdsc
    <condition id='driver.gt911.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.htu21d.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.icm42688p.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.igpio.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.ili9341.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.iomuxc.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.lpi2c.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.lpi2c_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.lpi2c, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.lpi2c, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.lpspi.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.lpspi_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.lpspi, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.lpspi, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.lpuart.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.lpuart_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.lpuart, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.lpuart, device=MIMXRT1042.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.lsm6dso.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.max30101.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.mma8451q.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.mma8652fc.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.mx25r_flash.condition_id'>
      <require condition='allOf.device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.nic301.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.nmh1000.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.ocotp.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.p3t1755.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.pcm186x.condition_id'>
      <require condition='allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT1042.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_adapters'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_i2c'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pcm186x_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.pcm512x.condition_id'>
      <require condition='allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT1042.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_adapters'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_i2c'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pcm512x_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec'/>
      <require condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.pf1550.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.pf3000.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.pf5020.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='driver.pit.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.pmu.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1042xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.psp27801.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1042.internal_condition'/>
    </condition>
