vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1042_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-ksz8041' Cversion='2.0.0' condition='component.phyksz8041.condition_id'>
      <description>Driver phy-device-ksz8041</description>
      <files>
        <file category='sourceC' name='components/phy/device/phyksz8041/fsl_phyksz8041.c' projectpath='component/phy'/>
        <file category='header' name='components/phy/device/phyksz8041/fsl_phyksz8041.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/device/phyksz8041/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-ksz8081' Cversion='2.0.0' condition='component.phyksz8081.condition_id'>
      <description>Driver phy-device-ksz8081</description>
      <files>
        <file category='sourceC' name='components/phy/device/phyksz8081/fsl_phyksz8081.c' projectpath='component/phy'/>
        <file category='header' name='components/phy/device/phyksz8081/fsl_phyksz8081.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/device/phyksz8081/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-lan8720a' Cversion='2.0.0' condition='component.phylan8720a.condition_id'>
      <description>Driver phy-device-lan8720a</description>
      <files>
        <file category='sourceC' name='components/phy/device/phylan8720a/fsl_phylan8720a.c' projectpath='component/phy'/>
        <file category='header' name='components/phy/device/phylan8720a/fsl_phylan8720a.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/device/phylan8720a/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-lan8741' Cversion='2.0.0' condition='component.phylan8741.condition_id'>
      <description>Driver phy-device-lan8741</description>
      <files>
        <file category='sourceC' name='components/phy/device/phylan8741/fsl_phylan8741.c' projectpath='phy'/>
        <file category='header' name='components/phy/device/phylan8741/fsl_phylan8741.h' projectpath='phy'/>
        <file category='include' name='components/phy/device/phylan8741/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-rtl8201' Cversion='2.0.0' condition='component.phyrtl8201.condition_id'>
      <description>Driver phy-device-rtl8201</description>
      <files>
        <file category='sourceC' name='components/phy/device/phyrtl8201/fsl_phyrtl8201.c' projectpath='component/phy'/>
        <file category='header' name='components/phy/device/phyrtl8201/fsl_phyrtl8201.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/device/phyrtl8201/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-rtl8211f' Cversion='2.0.0' condition='component.phyrtl8211f.condition_id'>
      <description>Driver phy-device-rtl8211f</description>
      <files>
        <file category='sourceC' name='components/phy/device/phyrtl8211f/fsl_phyrtl8211f.c' projectpath='component/phy'/>
        <file category='header' name='components/phy/device/phyrtl8211f/fsl_phyrtl8211f.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/device/phyrtl8211f/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-tja1100' Cversion='2.0.0' condition='component.phytja1100.condition_id'>
      <description>Driver phy-device-tja1100</description>
      <files>
        <file category='sourceC' name='components/phy/device/phytja1100/fsl_phytja1100.c' projectpath='component/phy'/>
        <file category='header' name='components/phy/device/phytja1100/fsl_phytja1100.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/device/phytja1100/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-tja1120' Cversion='2.0.0' condition='component.phytja1120.condition_id'>
      <description>Driver phy-device-tja1120</description>
      <files>
        <file category='sourceC' name='components/phy/device/phytja1120/fsl_phytja1120.c' projectpath='component/phy'/>
        <file category='header' name='components/phy/device/phytja1120/fsl_phytja1120.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/device/phytja1120/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-vsc8541' Cversion='2.0.0' condition='component.phyvsc8541.condition_id'>
      <description>Driver phy-device-vsc8541</description>
      <files>
        <file category='sourceC' name='components/phy/device/phyvsc8541/fsl_phyvsc8541.c' projectpath='component/phy'/>
        <file category='header' name='components/phy/device/phyvsc8541/fsl_phyvsc8541.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/device/phyvsc8541/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-device-yt8521' Cversion='2.0.0' condition='component.phyyt8521.condition_id'>
      <description>Driver phy-device-yt8521</description>
      <files>
        <file category='sourceC' name='components/phy/device/phyyt8521/fsl_phyyt8521.c' projectpath='component/phy'/>
        <file category='header' name='components/phy/device/phyyt8521/fsl_phyyt8521.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/device/phyyt8521/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='pit_adapter' Cversion='1.0.0' condition='component.pit_adapter.condition_id'>
      <description>Component pit_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_PIT
#define TIMER_PORT_TYPE_PIT 1
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/timer/fsl_adapter_timer.h' projectpath='component/timer'/>
        <file category='sourceC' name='components/timer/fsl_adapter_pit.c' projectpath='component/timer'/>
        <file category='include' name='components/timer/'/>
      </files>
    </component>
