vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1042_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_88w8987' Cversion='1.0.0' condition='component.wifi_bt_module.88W8987.condition_id'>
      <description>88W8987 Wi-Fi</description>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.88W8987_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_iw416' Cversion='1.0.0' condition='component.wifi_bt_module.IW416.condition_id'>
      <description>IW416 Wi-Fi</description>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.IW416_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_iw61x' Cversion='1.0.0' condition='component.wifi_bt_module.IW61X.condition_id'>
      <description>IW61X Wi-Fi</description>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.IW61X_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_rw61x' Cversion='1.0.0' condition='component.wifi_bt_module.RW61X.condition_id'>
      <description>RW61X Wi-Fi</description>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.RW61X_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am457_usd' Cversion='1.0.0' condition='component.wifi_bt_module.board_aw_am457_usd.condition_id'>
      <description>IW416-AW-AM457-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_AW_AM457_USD
        #define WIFI_IW416_BOARD_AW_AM457_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_aw_am457_usd_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am457ma' Cversion='1.0.0' condition='component.wifi_bt_module.board_aw_am457ma.condition_id'>
      <description>IW416-AW-AM457MA-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_AW_AM457MA
        #define WIFI_IW416_BOARD_AW_AM457MA
        #endif
      </RTE_Components_h>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_aw_am457ma_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am510_arduino' Cversion='1.0.0' condition='component.wifi_bt_module.board_aw_am510_arduino.condition_id'>
      <description>FRDM-IW416-AW-AM510 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_AW_AM510_ARDUINO
        #define WIFI_IW416_BOARD_AW_AM510_ARDUINO
        #endif
      </RTE_Components_h>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_aw_am510_arduino_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am510_usd' Cversion='1.0.0' condition='component.wifi_bt_module.board_aw_am510_usd.condition_id'>
      <description>IW416-AW-AM510-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_AW_AM510_USD
        #define WIFI_IW416_BOARD_AW_AM510_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_aw_am510_usd_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am510ma' Cversion='1.0.0' condition='component.wifi_bt_module.board_aw_am510ma.condition_id'>
      <description>IW416-AW-AM510-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_AW_AM510MA
        #define WIFI_IW416_BOARD_AW_AM510MA
        #endif
      </RTE_Components_h>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_aw_am510ma_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_cm358_usd' Cversion='1.0.0' condition='component.wifi_bt_module.board_aw_cm358_usd.condition_id'>
      <description>AW-CM358-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_AW_CM358_USD
        #define WIFI_88W8987_BOARD_AW_CM358_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_aw_cm358_usd_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_cm358ma' Cversion='1.0.0' condition='component.wifi_bt_module.board_aw_cm358ma.condition_id'>
      <description>AW-CM358MA-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_AW_CM358MA
        #define WIFI_88W8987_BOARD_AW_CM358MA
        #endif
      </RTE_Components_h>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_aw_cm358ma_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_nm191_usd' Cversion='1.0.0' condition='component.wifi_bt_module.board_aw_nm191_usd.condition_id'>
      <description>AW-NM191-USD Wi-Fi board</description>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_aw_nm191_usd_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_nm191ma' Cversion='1.0.0' condition='component.wifi_bt_module.board_aw_nm191ma.condition_id'>
      <description>AW-NM191MA-M2 Wi-Fi board</description>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_aw_nm191ma_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_frdm_rw61x' Cversion='1.0.0' condition='component.wifi_bt_module.board_frdm_rw61x.condition_id'>
      <description>FRDM-RW61X Wi-Fi board</description>
      <RTE_Components_h>
#ifndef WIFI_BOARD_FRDM_RW61X
#define WIFI_BOARD_FRDM_RW61X 
#endif
</RTE_Components_h>
      <files>
        <file category='doc' name='components/wifi_bt_module/component.wifi_bt_module.board_frdm_rw61x_dummy.txt'/>
      </files>
    </component>
