vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1042_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='adc_12b1msps_sar' Cversion='2.0.4' condition='driver.adc_12b1msps_sar.condition_id'>
      <description>ADC Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1042/drivers/fsl_adc.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1042/drivers/fsl_adc.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1042/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='adc_etc' Cversion='2.3.2' condition='driver.adc_etc.condition_id'>
      <description>ADC_ETC Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1042/drivers/fsl_adc_etc.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1042/drivers/fsl_adc_etc.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1042/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='aipstz' Cversion='2.0.1' condition='driver.aipstz.condition_id'>
      <description>aipstz Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1042/drivers/fsl_aipstz.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1042/drivers/fsl_aipstz.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1042/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ak4497' Cversion='2.1.2' condition='driver.ak4497.condition_id'>
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/ak4497/fsl_ak4497.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/ak4497/fsl_ak4497.c' projectpath='codec'/>
        <file category='include' name='components/codec/ak4497/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='aoi' Cversion='2.0.2' condition='driver.aoi.condition_id'>
      <description>AOI Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1042/drivers/fsl_aoi.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1042/drivers/fsl_aoi.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1042/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='bee' Cversion='2.0.2' condition='driver.bee.condition_id'>
      <description>BEE Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1042/drivers/fsl_bee.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1042/drivers/fsl_bee.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1042/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='cache_armv7_m7' Cversion='2.0.4' condition='driver.cache_armv7_m7.condition_id'>
      <description>CACHE Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1042/drivers/fsl_cache.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1042/drivers/fsl_cache.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1042/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='camera-common' Cversion='1.0.0' condition='driver.camera-common.condition_id'>
      <description>Driver camera-common</description>
      <files>
        <file category='header' name='components/video/camera/fsl_camera.h' projectpath='video'/>
        <file category='include' name='components/video/camera/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='camera-device-ap1302' Cversion='1.0.1' condition='driver.camera-device-ap1302.condition_id'>
      <description>Driver camera-device-ap1302</description>
      <files>
        <file category='header' name='components/video/camera/device/ap1302/fsl_ap1302.h' projectpath='video'/>
        <file category='sourceC' name='components/video/camera/device/ap1302/fsl_ap1302.c' projectpath='video'/>
        <file category='include' name='components/video/camera/device/ap1302/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='camera-device-common' Cversion='1.0.0' condition='driver.camera-device-common.condition_id'>
      <description>Driver camera-device-common</description>
      <files>
        <file category='header' name='components/video/camera/device/fsl_camera_device.h' projectpath='video'/>
        <file category='include' name='components/video/camera/device/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='camera-device-max9286' Cversion='1.0.2' condition='driver.camera-device-max9286.condition_id'>
      <description>Driver camera-device-max9286</description>
      <files>
        <file category='header' name='components/video/camera/device/max9286/fsl_max9286.h' projectpath='video'/>
        <file category='sourceC' name='components/video/camera/device/max9286/fsl_max9286.c' projectpath='video'/>
        <file category='include' name='components/video/camera/device/max9286/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='camera-device-mt9m114' Cversion='1.0.2' condition='driver.camera-device-mt9m114.condition_id'>
      <description>Driver camera-device-mt9m114</description>
      <files>
        <file category='header' name='components/video/camera/device/mt9m114/fsl_mt9m114.h' projectpath='video'/>
        <file category='sourceC' name='components/video/camera/device/mt9m114/fsl_mt9m114.c' projectpath='video'/>
        <file category='include' name='components/video/camera/device/mt9m114/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='camera-device-ov5640' Cversion='1.0.1' condition='driver.camera-device-ov5640.condition_id'>
      <description>Driver camera-device-ov5640</description>
      <files>
        <file category='header' name='components/video/camera/device/ov5640/fsl_ov5640.h' projectpath='video'/>
        <file category='sourceC' name='components/video/camera/device/ov5640/fsl_ov5640.c' projectpath='video'/>
        <file category='include' name='components/video/camera/device/ov5640/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='camera-device-ov7670' Cversion='1.0.2' condition='driver.camera-device-ov7670.condition_id'>
      <description>Driver camera-device-ov7670</description>
      <files>
        <file category='header' name='components/video/camera/device/ov7670/fsl_ov7670.h' projectpath='video'/>
        <file category='sourceC' name='components/video/camera/device/ov7670/fsl_ov7670.c' projectpath='video'/>
        <file category='include' name='components/video/camera/device/ov7670/'/>
      </files>
    </component>
