vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1042_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='incbin' Cversion='1.0.0' condition='utility.incbin.condition_id'>
      <description>Used to include slave core binary into master core binary.</description>
      <files>
        <file condition='allOf.toolchains=armgcc, mdk.condition_id' category='sourceAsm' name='devices/MIMXRT1042/utilities/incbin/fsl_incbin.S' projectpath='utilities'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='notifier' Cversion='1.0.0' condition='utility.notifier.condition_id'>
      <description>Utility notifier</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1042/utilities/fsl_notifier.c' projectpath='utilities/utilities'/>
        <file category='header' name='devices/MIMXRT1042/utilities/fsl_notifier.h' projectpath='utilities/utilities'/>
        <file category='include' name='devices/MIMXRT1042/utilities/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='shell' Cversion='1.0.0' condition='utility.shell.condition_id'>
      <description>Utility shell</description>
      <files>
        <file category='header' name='devices/MIMXRT1042/utilities/shell/fsl_shell.h' projectpath='utilities'/>
        <file category='sourceC' name='devices/MIMXRT1042/utilities/shell/fsl_shell.c' projectpath='utilities'/>
        <file category='include' name='devices/MIMXRT1042/utilities/shell/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='str' Cversion='1.0.0' condition='utility.str.condition_id'>
      <description>Utility str</description>
      <files>
        <file category='header' name='devices/MIMXRT1042/utilities/str/fsl_str.h' projectpath='utilities/str'/>
        <file category='sourceC' name='devices/MIMXRT1042/utilities/str/fsl_str.c' projectpath='utilities/str'/>
        <file category='include' name='devices/MIMXRT1042/utilities/str/'/>
      </files>
    </component>
  </components>
</package>